Configuration/Catalogs/ДополнительныеКолонкиСписковЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДополнительныеКолонкиСписковЗадач</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоддержки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Configuration/InformationRegisters/ПутиКЗначениямДополнительныхКолонокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПутиКЗначениямДополнительныхКолонокЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПутьКЗначению</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеКолонкиСписковЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/InformationRegisters/ОчередьЗаполненияДополнительныхКолонокЗадач.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьЗаполненияДополнительныхКолонокЗадач</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Колонка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеКолонкиСписковЗадач</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Configuration/Catalogs/ДополнительныеКолонкиСписковЗадач/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Сохраняет записи из справочника и связанного регистра сведений в файл XML.
//
Процедура СохранитьКолонкиВФайл(Колонки, ИмяФайла) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительныеКолонкиСписковЗадач.Ссылка КАК Ссылка,
	|	ДополнительныеКолонкиСписковЗадач.Наименование КАК Наименование,
	|	ДополнительныеКолонкиСписковЗадач.ИдентификаторПоддержки КАК ИдентификаторПоддержки,
	|	ДополнительныеКолонкиСписковЗадач.ТипыЗначений КАК ТипыЗначений,
	|	ПутиКЗначениямДополнительныхКолонокЗадач.ПутьКЗначению КАК ПутьКЗначению,
	|	ИдентификаторыОбъектовМетаданных.Имя КАК Имя
	|ИЗ
	|	Справочник.ДополнительныеКолонкиСписковЗадач КАК ДополнительныеКолонкиСписковЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПутиКЗначениямДополнительныхКолонокЗадач КАК ПутиКЗначениямДополнительныхКолонокЗадач
	|		ПО ДополнительныеКолонкиСписковЗадач.Ссылка = ПутиКЗначениямДополнительныхКолонокЗадач.Колонка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИдентификаторыОбъектовМетаданных КАК ИдентификаторыОбъектовМетаданных
	|		ПО (ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента = ИдентификаторыОбъектовМетаданных.Ссылка)
	|ГДЕ
	|	ДополнительныеКолонкиСписковЗадач.Ссылка В(&Ссылка)
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Колонки);
	
	ВыборкаКолонки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если УстановитьИдентификаторыПоддержкиДополнительныхКолонок(ВыборкаКолонки) Тогда
		ВыборкаКолонки = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Иначе
		ВыборкаКолонки.Сбросить();
	КонецЕсли;
	
	Выгрузка = Новый ЗаписьXML;
	Выгрузка.ОткрытьФайл(ИмяФайла);
	
	Выгрузка.ЗаписатьОбъявлениеXML();
	Выгрузка.ЗаписатьНачалоЭлемента("FileContent");
	Выгрузка.ЗаписатьСоответствиеПространстваИмен("nspxml", "http://www.w3.org/2001/XMLSchema");
	
	Пока ВыборкаКолонки.Следующий() Цикл
		
		Выгрузка.ЗаписатьНачалоЭлемента("Колонка");
		Выгрузка.ЗаписатьАтрибут("Наименование", ВыборкаКолонки.Наименование);
		Выгрузка.ЗаписатьАтрибут("ИдентификаторПоддержки", XMLСтрока(ВыборкаКолонки.ИдентификаторПоддержки));
		Выгрузка.ЗаписатьАтрибут("ТипыЗначений", ВыборкаКолонки.ТипыЗначений);
		
		ВыборкаПути = ВыборкаКолонки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПути.Следующий() Цикл
			
			Выгрузка.ЗаписатьНачалоЭлемента("Документ");
			Выгрузка.ЗаписатьАтрибут("Имя", ВыборкаПути.Имя);
			Выгрузка.ЗаписатьАтрибут("Путь", ВыборкаПути.ПутьКЗначению);
			Выгрузка.ЗаписатьКонецЭлемента(); // Документ
			
		КонецЦикла;
		
		Выгрузка.ЗаписатьКонецЭлемента(); // Колонка
		
	КонецЦикла;
	
	Выгрузка.ЗаписатьКонецЭлемента(); // FileContent
	
КонецПроцедуры

Процедура ЗагрузитьКолонкиИзФайла(АдресФайлаЗагрузки, СоответствиеКолонок) Экспорт
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
	ДанныеФайла = ПолучитьИзВременногоХранилища(АдресФайлаЗагрузки);
	ДанныеФайла.Записать(ИмяВременногоФайла);
	
	ТекстовыйДокумент = Новый ТекстовыйДокумент;
	ТекстовыйДокумент.Прочитать(ИмяВременногоФайла);
	ТекстФайла = ТекстовыйДокумент.ПолучитьТекст();
	ТекстовыйДокумент = Неопределено;
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		// обработка исключения не требуется
	КонецПопытки;
	
	НачатьТранзакцию();
	Попытка
		
		ПроцессыОбработкиДокументов.ЗаблокироватьРегистрОчередьЗаполненияДополнительныхКолонокЗадач();
		
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗаполнитьТаблицуТекущихПутей(МенеджерВременныхТаблиц);
		
		ЗагрузитьКолонки(ТекстФайла, СоответствиеКолонок);
		
		ЗапланироватьЗаполнениеИзмененныхКолонок(МенеджерВременныхТаблиц);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Загрузка дополнительных колонок задач'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция УстановитьИдентификаторыПоддержкиДополнительныхКолонок(ВыборкаКолонки)
	
	КолонкиДляУстановкиИдентификатора = Новый Массив;
	
	Пока ВыборкаКолонки.Следующий() Цикл
		Если ВыборкаКолонки.ИдентификаторПоддержки = ОбщегоНазначенияКлиентСервер.ПустойУникальныйИдентификатор() Тогда
			КолонкиДляУстановкиИдентификатора.Добавить(ВыборкаКолонки.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Если КолонкиДляУстановкиИдентификатора.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	Для Каждого Колонка Из КолонкиДляУстановкиИдентификатора Цикл
		ЭлементБлокировки = Блокировка.Добавить("Справочник.ДополнительныеКолонкиСписковЗадач");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Колонка);
	КонецЦикла;
	
	НачатьТранзакцию();
	Попытка
		Блокировка.Заблокировать();
		
		Для Каждого Колонка Из КолонкиДляУстановкиИдентификатора Цикл
			
			КолонкаОбъект = Колонка.ПолучитьОбъект();
			
			КолонкаОбъект.Заблокировать();
			
			КолонкаОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор;
			
			КолонкаОбъект.Записать();
			
		КонецЦикла;
		
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Установка идентификатора поддержки для дополнительных колонок'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции

Процедура ЗагрузитьКолонки(Данные, СоответствиеКолонок)
	
	ФайлДанных = Новый ЧтениеXML;
	ФайлДанных.УстановитьСтроку(Данные);
	
	Пока ФайлДанных.Прочитать() Цикл
		
		Если ФайлДанных.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
			
			Если ФайлДанных.Имя = "Колонка" Тогда
				
				ИдентификаторПоддержки = ФайлДанных.ПолучитьАтрибут("ИдентификаторПоддержки");
				Наименование = ФайлДанных.ПолучитьАтрибут("Наименование");
				ТипыЗначений = ФайлДанных.ПолучитьАтрибут("ТипыЗначений");
				
				КолонкаСсылка = СоответствиеКолонок.Получить(ИдентификаторПоддержки);
				
				Если КолонкаСсылка.Пустая() Тогда
					
					КолонкаОбъект = Справочники.ДополнительныеКолонкиСписковЗадач.СоздатьЭлемент();
					КолонкаОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					КолонкаОбъект.Наименование = Наименование;
					КолонкаОбъект.ТипыЗначений = ТипыЗначений;
					
					КолонкаСсылка = Справочники.ДополнительныеКолонкиСписковЗадач.ПолучитьСсылку();
					СоответствиеКолонок.Вставить(ИдентификаторПоддержки, КолонкаСсылка);
					
					КолонкаОбъект.УстановитьСсылкуНового(КолонкаСсылка);
					
				Иначе
					КолонкаОбъект = КолонкаСсылка.ПолучитьОбъект();
					КолонкаОбъект.ИдентификаторПоддержки = Новый УникальныйИдентификатор(ИдентификаторПоддержки);
					КолонкаОбъект.Наименование = Наименование;
					КолонкаОбъект.ТипыЗначений = ТипыЗначений;
				КонецЕсли;
				
				НаборЗаписей = РегистрыСведений.ПутиКЗначениямДополнительныхКолонокЗадач.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Колонка.Установить(КолонкаСсылка);
				
			ИначеЕсли ФайлДанных.Имя = "Документ" Тогда
				
				ИмяДокумента = ФайлДанных.ПолучитьАтрибут("Имя");
				ПутьКЗначению = ФайлДанных.ПолучитьАтрибут("Путь");
				
				ТипДанных = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Документ." + ИмяДокумента, Ложь);
				
				Запись = НаборЗаписей.Добавить();
				Запись.Колонка = КолонкаСсылка;
				Запись.ИдентификаторДокумента = ТипДанных;
				Запись.ПутьКЗначению = ПутьКЗначению;
				
			КонецЕсли;
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ФайлДанных.Имя = "Колонка" Тогда
			
			КолонкаОбъект.Записать();
			
			НаборЗаписей.Записать();
			
		ИначеЕсли ФайлДанных.ТипУзла = ТипУзлаXML.КонецЭлемента
			И ФайлДанных.Имя = "FileContent" Тогда
			
			Возврат;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТаблицуТекущихПутей(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПутиКЗначениямДополнительныхКолонокЗадач.Колонка КАК Колонка,
	|	ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента КАК ИдентификаторДокумента,
	|	ПутиКЗначениямДополнительныхКолонокЗадач.ПутьКЗначению КАК ПутьКЗначению
	|ПОМЕСТИТЬ ВТПредыдущиеПути
	|ИЗ
	|	РегистрСведений.ПутиКЗначениямДополнительныхКолонокЗадач КАК ПутиКЗначениямДополнительныхКолонокЗадач";
	
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура ЗапланироватьЗаполнениеИзмененныхКолонок(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВТПредыдущиеПути.Колонка КАК Колонка,
	|	ВТПредыдущиеПути.ИдентификаторДокумента КАК ИдентификаторДокумента
	|ИЗ
	|	ВТПредыдущиеПути КАК ВТПредыдущиеПути
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПутиКЗначениямДополнительныхКолонокЗадач КАК ПутиКЗначениямДополнительныхКолонокЗадач
	|		ПО ВТПредыдущиеПути.Колонка = ПутиКЗначениямДополнительныхКолонокЗадач.Колонка
	|			И ВТПредыдущиеПути.ИдентификаторДокумента = ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента
	|			И ВТПредыдущиеПути.ПутьКЗначению = ПутиКЗначениямДополнительныхКолонокЗадач.ПутьКЗначению
	|ГДЕ
	|	ПутиКЗначениямДополнительныхКолонокЗадач.Колонка ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	ПутиКЗначениямДополнительныхКолонокЗадач.Колонка,
	|	ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента
	|ИЗ
	|	РегистрСведений.ПутиКЗначениямДополнительныхКолонокЗадач КАК ПутиКЗначениямДополнительныхКолонокЗадач
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТПредыдущиеПути КАК ВТПредыдущиеПути
	|		ПО ПутиКЗначениямДополнительныхКолонокЗадач.Колонка = ВТПредыдущиеПути.Колонка
	|			И ПутиКЗначениямДополнительныхКолонокЗадач.ИдентификаторДокумента = ВТПредыдущиеПути.ИдентификаторДокумента
	|			И ПутиКЗначениямДополнительныхКолонокЗадач.ПутьКЗначению = ВТПредыдущиеПути.ПутьКЗначению
	|ГДЕ
	|	ВТПредыдущиеПути.Колонка ЕСТЬ NULL";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ОчередьЗаполненияДополнительныхКолонокЗадач.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Колонка = Выборка.Колонка;
		МенеджерЗаписи.ИдентификаторДокумента = Выборка.ИдентификаторДокумента;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	// Включение регламентного задания
	Если Выборка.Количество() > 0 Тогда
		ПроцессыОбработкиДокументов.ВключитьЗаполнениеДополнительныхКолонокЗадач();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
